_posts/2016-07-16-linux防火墙.html
---
title: "Linux防火墙iptables"
date: 2016-07-16
layout: post
categories: 
- Linux
tags: 
- Linux 
- 运维 
- 安全
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 防火墙</a></li>
<li><a href="#orgheadline2">2. iptables的组成</a></li>
<li><a href="#orgheadline8">3. iptables的四表五链</a>
<ul>
<li><a href="#orgheadline3">表(table)</a></li>
<li><a href="#orgheadline4">链(chain)</a></li>
<li><a href="#orgheadline5">报文的线路</a></li>
<li><a href="#orgheadline6">链上的表实现</a></li>
<li><a href="#orgheadline7">表的优先级次序</a></li>
</ul>
</li>
<li><a href="#orgheadline12">4. iptables表的规则</a>
<ul>
<li><a href="#orgheadline9">定义规则的法则</a></li>
<li><a href="#orgheadline10">规则的组成部分</a></li>
<li><a href="#orgheadline11">规则和链有计数器</a></li>
</ul>
</li>
<li><a href="#orgheadline26">5. iptables命令</a>
<ul>
<li><a href="#orgheadline13">table</a></li>
<li><a href="#orgheadline14">链管理</a></li>
<li><a href="#orgheadline15">规则管理</a></li>
<li><a href="#orgheadline16">规则查看</a></li>
<li><a href="#orgheadline22">匹配条件(rule-specification)</a>
<ul>
<li><a href="#orgheadline17">基本匹配条件</a></li>
<li><a href="#orgheadline18">扩展匹配条件</a></li>
<li><a href="#orgheadline21">目标(TARGET)</a></li>
</ul>
</li>
<li><a href="#orgheadline23">保存和重载规则</a></li>
<li><a href="#orgheadline25">例子</a>
<ul>
<li><a href="#orgheadline24">仅允许自己ping通别人</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
TODO
</p>




<hr  />
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 防火墙</h2>
<div class="outline-text-2" id="text-1">
<p>
Firewall: 防火墙工作于主机或网络的边缘，对于进出本主机或网络的报文根据事先定义好的检查规则作匹配检测，对于能够被规则所匹配到的报文做出相应处理的组件
</p>
<ul class="org-ul">
<li>主机防火墙: 服务器本身</li>
<li>网络防火墙: 网络中转</li>
<li>IPS: IDS检测到入侵行为的时候通知Firewall，Firewall自动生成应对的规则
<ul class="org-ul">
<li>HIDS(主机)、NIDS(网络)</li>
<li>honeypot: 用于诱捕入侵者的服务器</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> iptables的组成</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>framework: netfilter，内核TCP/IP所实现的网络过滤器框架，通过在报文的经过路线(五条链)上添加 <code>hooks function</code> 实现</li>
<li>rule utils: iptables，负责对 <code>hooks function</code> 的规则进行设置，是一个规则管理的命令行工具，工作在用户空间上</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">3</span> iptables的四表五链</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">表(table)</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
iptables的表即是iptables的功能
</p>
<ul class="org-ul">
<li>filter: 过滤，防火墙</li>
<li>nat: network address translation，网络地址转换</li>
<li>mangle：拆解报文，做出修改，封装报文</li>
<li>raw：关闭nat表上启用的连接追踪机制(使用历史访问记录功能)</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">链(chain)</h3>
<div class="outline-text-3" id="text-orgheadline4">
<ul class="org-ul">
<li>PREROUTING: 报文刚进入主机时，判断其目标主机</li>
<li>INPUT: 报文要到达内部端口前</li>
<li>FORWARD: 路由机制内</li>
<li>OUTPUT: 报文刚从内部端口发送时</li>
<li>POSTROUTING: 报文准备发送出主机前，判断经由哪个接口发出</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">报文的线路</h3>
<div class="outline-text-3" id="text-orgheadline5">
<ul class="org-ul">
<li>流入本机: PREROUTING &#x2013;&gt; INPUT</li>
<li>本机发出: OUTPUT &#x2013;&gt; POSTROUTING</li>
<li>通过本机转发: PREROUTING &#x2013;&gt; FORWARD &#x2013;&gt; POSTROUTING</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">链上的表实现</h3>
<div class="outline-text-3" id="text-orgheadline6">
<ul class="org-ul">
<li>filter：INPUT, FORWARD, OUTPUT</li>
<li>nat: PREROUTING(DNAT), OUTPUT, POSTROUTING(SNAT)</li>
<li>mangle：PREROUTING, INPUT, FORWARD, OUTPUT, POSTROUTING</li>
<li>raw：PREROUTING, OUTPUT</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">表的优先级次序</h3>
<div class="outline-text-3" id="text-orgheadline7">
<p>
raw &#x2013;&gt; mangle &#x2013;&gt; nat &#x2013;&gt; filter
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">4</span> iptables表的规则</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">定义规则的法则</h3>
<div class="outline-text-3" id="text-orgheadline9">
<p>
链上规则的次序，即为检查的次序，因此
</p>
<ol class="org-ol">
<li>同类规则(访问同一应用)，匹配范围小的放上面</li>
<li>不同类规则(访问不同应用)，匹配到报文频率较大的放上面</li>
<li>将那些可由一条规则描述的多个规则合并为一个</li>
<li>设置默认策略</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">规则的组成部分</h3>
<div class="outline-text-3" id="text-orgheadline10">
<ul class="org-ul">
<li>匹配条件(rule-specification): 根据协议报文特征指定</li>
<li>处理动作(target): 可使用内建处理机制，也可自定义处理</li>
<li>自定义链: 报文不会经过自定义链，只能在内置链上通过规则进行引用后生效</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">规则和链有计数器</h3>
<div class="outline-text-3" id="text-orgheadline11">
<ul class="org-ul">
<li>pkts：由规则或链所匹配到的报文的个数</li>
<li>bytes：由规则或链匹配到的所有报文大小之和</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-2">
<h2 id="orgheadline26"><span class="section-number-2">5</span> iptables命令</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-conf">iptables [-t table] SUBCOMMAND CHAIN CRETERIA -j TARGET

iptables [-t table] -S [chain [rulenum]]
</pre>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13">table</h3>
<div class="outline-text-3" id="text-orgheadline13">
<p>
filter(默认), nat, mangle, raw
</p>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">链管理</h3>
<div class="outline-text-3" id="text-orgheadline14">
<div class="org-src-container">

<pre class="src src-conf">iptables [-t table] {-F|-L|-Z} [chain [rulenum]] [options...]
  -F: flush&#65292;&#28165;&#31354;&#35268;&#21017;&#38142;&#65307;&#30465;&#30053;&#38142;&#65292;&#34920;&#31034;&#28165;&#31354;&#25351;&#23450;&#34920;&#19978;&#30340;&#25152;&#26377;&#30340;&#38142;
  -Z: zero&#65292;&#28165;&#38646;&#65292;&#32622;&#38646;&#35268;&#21017;&#35745;&#25968;&#22120;

iptables [-t table] -N chain
iptables [-t table] -X [chain]
iptables [-t table] -E old-chain-name new-chain-name
  -N: new, &#21019;&#24314;&#26032;&#30340;&#33258;&#23450;&#20041;&#35268;&#21017;&#38142;
  -X: drop, &#21024;&#38500;&#29992;&#25143;&#33258;&#23450;&#20041;&#30340;&#31354;&#30340;&#35268;&#21017;&#38142;
  -E: rEname&#65292;&#37325;&#21629;&#20196;&#33258;&#23450;&#20041;&#38142;&#65307;&#34987;&#24341;&#29992;&#30340;&#33258;&#23450;&#20041;&#38142;&#65292;&#26080;&#27861;&#25913;&#21517;&#21644;&#21024;&#38500;

iptables [-t table] -P chain target
  -P: Policy&#65292;&#20026;&#25351;&#23450;&#38142;&#35774;&#32622;&#40664;&#35748;&#31574;&#30053;&#65307;&#23545;filter&#34920;&#20013;&#30340;&#38142;&#32780;&#35328;&#65292;&#40664;&#35748;&#31574;&#30053;&#36890;&#24120;&#26377;ACCEPT, DROP, REJECT
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15">规则管理</h3>
<div class="outline-text-3" id="text-orgheadline15">
<div class="org-src-container">

<pre class="src src-conf">iptables [-t table] -A chain rule-specification
iptables [-t table] -D chain {rulenum|rule-specification}
iptables [-t table] -I chain [rulenum] rule-specification
iptables [-t table] -R chain rulenum rule-specification
  -A: append&#65292;&#23558;&#26032;&#35268;&#21017;&#36861;&#21152;&#20110;&#25351;&#23450;&#38142;&#30340;&#23614;&#37096;
  -I: insert&#65292;&#23558;&#26032;&#35268;&#21017;&#25554;&#20837;&#33267;&#25351;&#23450;&#38142;&#30340;&#25351;&#23450;&#20301;&#32622;(rulenum&#40664;&#35748;&#20026;1)
  -D: delete&#65292;&#21024;&#38500;&#25351;&#23450;&#38142;(&#20351;&#29992;&#21305;&#37197;&#26465;&#20214;&#25110;&#35268;&#21017;&#32534;&#21495;)&#19978;&#30340;&#25351;&#23450;&#35268;&#21017;
  -R: replace&#65292;&#26367;&#25442;&#25351;&#23450;&#38142;&#19978;&#30340;&#25351;&#23450;&#35268;&#21017;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16">规则查看</h3>
<div class="outline-text-3" id="text-orgheadline16">
<div class="org-src-container">

<pre class="src src-conf">iptables [-t table] -L [chain [rulenum]] [options...]
  -n: numberic&#65292;&#20197;&#25968;&#23383;&#26684;&#24335;&#26174;&#31034;&#22320;&#22336;&#21644;&#31471;&#21475;&#21495;
  -v|-vv|-vvv: verbose&#65292;&#26174;&#31034;&#35814;&#32454;&#20449;&#24687;(pkts&#21644;bytes)
  --line-numbers: &#26174;&#31034;&#35268;&#21017;&#32534;&#21495;&#65292;&#29992;&#20110;&#21024;&#38500;&#35268;&#21017;
  -x: exactly, &#26174;&#31034;&#35745;&#25968;&#22120;&#35745;&#25968;&#32467;&#26524;&#30340;&#31934;&#30830;&#20540;&#65292;&#19981;&#20570;&#21333;&#20301;&#25442;&#31639;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22">匹配条件(rule-specification)</h3>
<div class="outline-text-3" id="text-orgheadline22">
</div><div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17">基本匹配条件</h4>
<div class="outline-text-4" id="text-orgheadline17">
<ul class="org-ul">
<li>-s IP|Netaddr：检查报文中源IP地址是否符合此处指定的地址范围</li>
<li>-d IP|Netaddr：检查报文中目标IP地址是否符合此处指定的地址范围</li>
<li>-p {tcp|udp|icmp}：检查报文中的协议，即ip首部中的protocols所标识的协议</li>
<li>-i IFACE：数据报文的流入接口(仅能用于PREROUTING, INPUT及FORWARD链上)</li>
<li>-o IFACE：数据报文的流出接口(仅能用于FORWARD, OUTPUT及POSTROUTING链上)</li>
<li>! 条件: 表示非</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18">扩展匹配条件</h4>
<div class="outline-text-4" id="text-orgheadline18">
<p>
模块文件路径是/usr/lib64/xtables/*.so(小写字母)
</p>
</div>
<ul class="org-ul"><li><a id="orgheadline19"></a>隐式扩展<br  /><div class="outline-text-5" id="text-orgheadline19">
<p>
对-p protocol指明的协议进行的扩展，可省略-m选项
</p>
<ul class="org-ul">
<li>-p tcp
<ul class="org-ul">
<li>&#x2013;dport PORT[-PORT]：目标端口，可以是单个端口或连续多个端口</li>
<li>&#x2013;sport PORT[-PORT]: 源端口</li>
<li><p>
&#x2013;tcp-flags LIST1 LIST2：检查LIST1所指明的所有标志位，且这其中，LIST2所表示出的所有标记位必须为1，而余下的必须为0
</p>
<pre class="example">
SYN表示建立连接
FIN表示关闭连接
ACK表示响应
PSH表示有DATA数据传输
RST表示连接重置
</pre></li>
<li>&#x2013;syn: 相当于 &#x2013;tcp-flags SYN,ACK,FIN,RST SYN</li>
</ul></li>
<li>-p udp
<ul class="org-ul">
<li>&#x2013;dport</li>
<li>&#x2013;sport</li>
</ul></li>
<li>-p icmp
<ul class="org-ul">
<li><p>
&#x2013;icmp-type
</p>
<pre class="example">
可用数字表示报文类型，常见类型有：
  0：echo-reply
  8: echo-request
</pre></li>
</ul></li>
</ul>
</div></li>
<li><a id="orgheadline20"></a>显式扩展<br  /><div class="outline-text-5" id="text-orgheadline20">
<p>
必须使用-m选项显式指定使用的扩展，如 <code>-m macth_name --spec_options</code>
</p>
<pre class="example">
查询帮助:
  CentOS 6: man iptables
  CentOS 7: man iptables-extensions
</pre>
<ol class="org-ol">
<li><p>
multiport: 以离散方式定义多端口匹配(最多15个)
</p>
<ul class="org-ul">
<li>[!] &#x2013;sports port[,port|,port:port]&#x2026;: 源端口</li>
<li>[!] &#x2013;dports port[,port|,port:port]&#x2026;: 目标端口</li>
<li>[!] &#x2013;ports port[,port|,port:port]&#x2026;: 两者同时指定</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">iptables -I INPUT -s <span style="color: #AE81FF;">172.16.0.0/16</span> -d <span style="color: #AE81FF;">172.16.100.9</span> -p tcp -m multiport --dports <span style="color: #AE81FF;">22,80</span> -j ACCEPT
</pre>
</div></li>
<li><p>
iprange: 指明连续的ip地址范围
</p>
<ul class="org-ul">
<li>[!] &#x2013;src-range from[-to]：指明连续的源IP地址范围</li>
<li>[!] &#x2013;dst-range from[-to]：指明连续的目标IP地址范围</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">iptables -I INPUT -d <span style="color: #AE81FF;">172.16.100.9</span> -p tcp -m multiport --dports <span style="color: #AE81FF;">22:23,80</span> -m iprange --src-range <span style="color: #AE81FF;">172.16.100.1-172.16.100.120</span> -j ACCEPT
</pre>
</div></li>
<li><p>
string: 检查报文中出现的字符串
</p>
<ul class="org-ul">
<li>&#x2013;algo {bm|kmp}: 字符串比对算法</li>
<li>[!] &#x2013;string pattern</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">iptables -A INPUT -p tcp --dport <span style="color: #AE81FF;">80</span> -m string --algo bm --string <span style="color: #E6DB74;">'GET /index.html'</span> -j LOG
</pre>
</div></li>
<li><p>
time: 根据报文到达的时间与指定的时间范围(UTC时间)进行匹配
</p>
<ul class="org-ul">
<li>&#x2013;datestart YYYY-MM[-DD]</li>
<li>&#x2013;datestop YYYY-MM[-DD]</li>
<li>&#x2013;timestart hh:mm[:ss]</li>
<li>&#x2013;timestop hh:mm[:ss]</li>
<li>&#x2013;monthdays day[,day]</li>
<li>&#x2013;weekdays day[,day]</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">iptables -I INPUT -d <span style="color: #AE81FF;">172.16.100.9</span> -p tcp --dport <span style="color: #AE81FF;">80</span> -m time --timestart <span style="color: #AE81FF;">14:00</span> --timestop <span style="color: #AE81FF;">16:00</span> -j REJECT
</pre>
</div></li>
<li>connlimit: 根据每客户端IP或地址块的并发连接数进行匹配
<ul class="org-ul">
<li>&#x2013;connlimit-above n：连接的数量大于n</li>
<li>&#x2013;connlimit-upto n: 连接的数量小于等于n</li>
</ul></li>
<li>limit: 基于收发报文的速率做检查(使用令牌桶过滤器)
<ul class="org-ul">
<li>&#x2013;limit rate[/second|/minute|/hour|/day]</li>
<li>&#x2013;limit-burst number: 一开始的峰值(通过空闲速率的积累)</li>
</ul></li>
<li><p>
state: 根据连接追踪机制检查连接的状态
</p>
<pre class="example">
连接追踪功能相关内容
  调整连接追踪功能所能够容纳的最大连接数量: /proc/sys/net/nf_conntrack_max
  已经追踪到并记录下的连接: /proc/net/nf_conntrack
  不同协议或连接类型追踪的时长: /proc/sys/net/netfilter/
  可追踪的连接状态：
    NEW：新发出的请求(不包含响应)，连接追踪模板中不存此连接相关的信息条目
    ESTABLISHED：NEW状态之后，连接追踪模板中为其建立的条目失效之前期间内所进行的通信的状态
    RELATED：相关的连接，如ftp协议的命令连接与数据连接之间的关系
    INVALIED：无法识别的连接
</pre>
<ul class="org-ul">
<li>&#x2013;state STATE1,STATE2</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #75715E;"># </span><span style="color: #75715E;">&#21482;&#20801;&#35768;&#21035;&#20154;&#23545;&#26381;&#21153;&#22120;&#24314;&#31435;&#35775;&#38382;&#65292;&#19981;&#20801;&#35768;&#26381;&#21153;&#22120;&#23545;&#21035;&#20154;&#24314;&#31435;&#35775;&#38382;</span>
iptables -I INPUT -d <span style="color: #AE81FF;">172.16.100.9</span> -p tcp --dport <span style="color: #AE81FF;">80</span> -m state --state NEW,ESTABLISHED -j ACCEPT
iptables -I OUTPUT -s <span style="color: #AE81FF;">172.16.100.9</span> -p tcp --sport <span style="color: #AE81FF;">80</span> -m state --state ESTABLISHED -j ACCEPT

<span style="color: #75715E;"># </span><span style="color: #75715E;">&#20801;&#35768;&#24050;&#24314;&#31435;&#36830;&#25509;&#30340;&#35775;&#38382;&#65292;&#21152;&#24555;&#21305;&#37197;&#25928;&#29575;</span>
iptables -I INPUT -m state --state ESTABLISHED -j ACCEPT
iptables -I OUTPUT -m state --state ESTABLISHED -j ACCEPT

<span style="color: #75715E;"># </span><span style="color: #75715E;">&#24320;&#25918;&#34987;&#21160;&#27169;&#24335;&#30340;ftp&#26381;&#21153;</span>
modprobe nf_conntrack_ftp  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35013;&#36733;ftp&#36861;&#36394;&#26102;&#30340;&#19987;&#29992;&#30340;&#27169;&#22359;</span>
iptables -A INPUT -d LocalIP -p tcp --dport <span style="color: #AE81FF;">21</span> -m state --state NEW,ESTABLISHED -j ACCEPT  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20801;&#35768;&#21629;&#20196;&#36830;&#25509;</span>
iptables -A INPUT -d LocalIP -p tcp -m state --state RELATED,ESTABLISHED -j ACCEPT  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20801;&#35768;&#38543;&#26426;&#31471;&#21475;&#30340;&#25968;&#25454;&#36830;&#25509;</span>
iptables -A OUTPUT -s LocalIP -p tcp -m state --state ESTABLISHED -j ACCEPT
</pre>
</div></li>
</ol>
</div></li></ul>
</div>

<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21">目标(TARGET)</h4>
<div class="outline-text-4" id="text-orgheadline21">
<p>
<code>-j TARGET</code>: jump至定的TARGET(位于/usr/lib64/xtables/*.so大写字母的文件)
</p>
<ul class="org-ul">
<li>ACCEPT: 接受</li>
<li>DROP: 丢弃</li>
<li>REJECT: 拒绝</li>
<li>RETURN: 返回调用链</li>
<li>REDIRECT：端口重定向</li>
<li>LOG: 记录日志</li>
<li>MARK：做防火墙标记</li>
<li>DNAT：目标地址转换</li>
<li>SNAT：源地址转换</li>
<li>MASQUERADE：地址伪装</li>
<li>自定义链：由自定义链上的规则进行匹配检查</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23">保存和重载规则</h3>
<div class="outline-text-3" id="text-orgheadline23">
<div class="org-src-container">

<pre class="src src-conf">iptables-save &gt; /PATH/TO/SOMEFILE  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20445;&#23384;&#24403;&#21069;&#35268;&#21017;</span>
iptables-restore &lt; /PATH/FROM/SOMEFILE  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35835;&#21462;&#25991;&#20214;&#35268;&#21017;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25">例子</h3>
<div class="outline-text-3" id="text-orgheadline25">
</div><div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24">仅允许自己ping通别人</h4>
<div class="outline-text-4" id="text-orgheadline24">
<div class="org-src-container">

<pre class="src src-conf"><span style="color: #75715E;"># </span><span style="color: #75715E;">&#28165;&#31354;&#35268;&#21017;</span>
iptables -F
iptables -X

<span style="color: #75715E;"># </span><span style="color: #75715E;">&#35774;&#23450;&#40664;&#35748;&#25805;&#20316;</span>
iptables -P INPUT DROP
iptables -P OUTPUT DROP
iptables -P FORWARD DROP

<span style="color: #75715E;"># </span><span style="color: #75715E;">&#35774;&#23450;&#35268;&#21017;</span>
iptables -A INPUT -d &#26412;&#26426;IP -p icmp --icmp-type 0 -j ACCEPT
iptables -A OUTPUT -s &#26412;&#26426;IP -p icmp --icmp-type 8 -j ACCEPT
</pre>
</div>
</div>
</div>
</div>
</div>
